In [1]:
import pandas as pd

In [2]:
people = {
    "first" : ["Anish", "Ramish", "Samish", "Bamish"],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki"],
    "email" : ["anishramish56@gmail.com", "mainaliramish89@gmail.com", "shresthasamish28@gmail.com", "bamishkarki819@gmail.com"]
}

In [8]:
mydf = pd.DataFrame(people)
mydf

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [9]:
mydf['first']

0     Anish
1    Ramish
2    Samish
3    Bamish
Name: first, dtype: object

In [11]:
mydf.iloc[0:2]

    first     last                      email
0   Anish   Khadka    anishramish56@gmail.com
1  Ramish  Mainali  mainaliramish89@gmail.com

# Day 3 - All About Indexes